chrislongros/freebsd-src/share/man/man4/ps5dsense.4
.\" Copyright (c) 2026 Christos Longros <chris.longros@gmail.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 9, 2026
.Dt PS5DSENSE 4
.Os
.Sh NAME
.Nm ps5dsense
.Nd Sony PlayStation 5 DualSense gamepad driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device ps5dsense"
.Cd "device hid"
.Cd "device hidbus"
.Cd "device hidmap"
.Cd "device evdev"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
ps5dsense_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the Sony PlayStation 5 DualSense gamepad
connected over USB.
.Pp
The
.Pa /dev/input/event*
device presents the game controller as an
.Ar evdev
type device.
It is accessible to members of the
.Em games
group.
.Pp
The microphone mute button is reported as
.Dv KEY_MICMUTE ;
unlike the vendor driver on other systems,
.Nm
does not mute the built-in microphone itself.
.Sh SYSCTL VARIABLES
Next parameters are available as
.Xr sysctl 8
variables.
Debug parameter is available as
.Xr loader 8
tunable as well.
.Bl -tag -width indent
.It Va dev.ps5dsense.*.led_state
LED state: 0 - off, 1 - on.
.It Va dev.ps5dsense.*.led_color_r
LED color.
Red component.
.It Va dev.ps5dsense.*.led_color_g
LED color.
Green component.
.It Va dev.ps5dsense.*.led_color_b
LED color.
Blue component.
.It Va dev.ps5dsense.*.player_leds
Player indicator LEDs: -1 - off, 0 to 4 - player number.
.It Va hw.hid.ps5dsense.debug
Debug output level, where 0 is debugging disabled and larger values increase
debug message verbosity.
Default is 0.
.El
.Sh FILES
.Bl -tag -width /dev/input/event* -compact
.It Pa /dev/input/event*
input event device node.
.El
.Sh SEE ALSO
.Xr ps4dshock 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 16.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Christos Longros Aq Mt chris.longros@gmail.com .
.Sh BUGS
The
.Nm
driver does not support force-feedback events, haptic feedback or the
adaptive triggers.
.Pp
The touchpad and the motion sensors are not decoded.
The touchpad click is therefore not reported at all.
.Pp
Bluetooth operation is not supported.
